## DATA MANIPULATION WITH PANDAS

In this lab,you will learn how to manipulate data with pandas.Data Manipulation with PandasÂ¶
In this lab, you will learn how to manipulate data with Pandas. Here is an overview:

1. Basics of Pandas for data manipulation:

A. Series and DataFrames
B. Data Indexing and Selection, and Iteration
C. Data Wrangling
D. Dealing with Missing data
E. Basic operations and Functions
F. Aggregation Methods
G. Groupby
H. CrossTab
I. Merging, Joining and Concatenate
J. Beyond Dataframes: Working with CSV, and Excel
2. Real World Exploratory Data Analysis (EDA)

1. Basics of Pandas for data manipulation

A. Series and DataFrames
Both series and DataFrames are Pandas Data structures.

Series is like one dimensional NumPy array with axis labels.

DataFrame is multidimensional NumPy array with labels on rows and columns.

Working with NumPy, we saw that it supports numeric type data. Pandas on other hand supports whole range of data types, from numeric to strings, etc..

Since we are using python notebook, we do not need to install Pandas. We only just have to import it.

import pandas as pd

In [1]:
# importing numpy and pandas 

import numpy as np
import pandas as pd

# creating series

- series can be created from a python list,dictionary and NumPy array.

In [2]:
# creating a series from a python list

num_list = [1,2,3,4,5]
pd.Series(num_list)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
week_days = ['mon','tues','wed','thurs','fri']
pd.Series(week_days,index = ['a','b','c','d','e'])

a      mon
b     tues
c      wed
d    thurs
e      fri
dtype: object

note the data types `int64` and `object`

In [4]:
# creating the series from a dictionary

countries_code = {1:'united states',
                 91:'india',
                 49:'germany',
                 86:'china',
                 290:'rwanda'}
pd.Series(countries_code)

1      united states
91             india
49           germany
86             china
290           rwanda
dtype: object

In [5]:
population_dict = {'california':38332521,
                  'texas':2644819,
                  'new york':19651127,
                  'florida':19552860,
                  'illinois':12882135}

population = pd.Series(population_dict)
population

california    38332521
texas          2644819
new york      19651127
florida       19552860
illinois      12882135
dtype: int64

In [6]:
d = {1:'a',2:'b',3:'c',4:'d'}
pd.Series(d)

1    a
2    b
3    c
4    d
dtype: object

In [7]:
# creating the series from numpy array
# we provide the list of indexes
# if we dont provide the indexes,the default indexes are numbers .... starts from 0,1,2..

arr = np.array ([1,2,3,4,5])
pd.Series(arr)

0    1
1    2
2    3
3    4
4    5
dtype: int64

## creating  DataFrames

DataFrames are the most used pandas data structures . it can be created from a dictionary ,2D arry and Series

In [8]:
# creating DataFrames from a dictionary

countries = {'name':['usa','india','germany','rwanda'],
             'codes':[1,91,49,250]}

pd.DataFrame(countries)

      name  codes
0      usa      1
1    india     91
2  germany     49
3   rwanda    250

In [9]:
# creating a dataframe from a 2d array
#you pass the list of columns

array_2d = np.array([[1,2,3],[4,5,6],[7,8,9]])
pd.DataFrame(array_2d,columns=['column 1','column2','column 3'])

   column 1  column2  column 3
0         1        2         3
1         4        5         6
2         7        8         9

In [11]:
# creating DataFrame from a dictionary

countries = {'name':['usa','india','germany','rwanda'],
            'codes':[1,91,49,250]}
df = pd.DataFrame(countries,index=['a','b','c','d'])
df

      name  codes
a      usa      1
b    india     91
c  germany     49
d   rwanda    250

In [12]:
df['name']

a        usa
b      india
c    germany
d     rwanda
Name: name, dtype: object

In [13]:
df.name

a        usa
b      india
c    germany
d     rwanda
Name: name, dtype: object

In [14]:
df['codes']

a      1
b     91
c     49
d    250
Name: codes, dtype: int64

In [15]:
# when you have many columns,columns in list will be selected
df[['name','codes']]

      name  codes
a      usa      1
b    india     91
c  germany     49
d   rwanda    250

In [16]:
#this will return the first two rows
df[0:2]

    name  codes
a    usa      1
b  india     91

# you can also use `loc` to select data by the label indexes and the `iloc` to select by default integer index or by the position of the row

In [17]:
df.loc['a']

name     usa
codes      1
Name: a, dtype: object

In [18]:
df.loc['b':'d']

      name  codes
b    india     91
c  germany     49
d   rwanda    250

In [19]:
df[:'b']

    name  codes
a    usa      1
b  india     91

In [20]:
df.iloc[2]

name     germany
codes         49
Name: c, dtype: object

In [21]:
df.iloc[1:3]

      name  codes
b    india     91
c  germany     49

In [22]:
df.iloc[2:]

      name  codes
c  germany     49
d   rwanda    250

# conditional selection

In [23]:
df

      name  codes
a      usa      1
b    india     91
c  germany     49
d   rwanda    250

In [24]:
# lets select a country with code 49
df[df['codes']==49]

      name  codes
c  germany     49

In [25]:
df[df['codes']< 250]

      name  codes
a      usa      1
b    india     91
c  germany     49

In [26]:
df[df['name']=='usa']

  name  codes
a  usa      1

In [27]:
# you can use and(&) or(|) for more than condition
#df[(condition1) & (condition2)]

df[(df['codes']==91)&(df['name']=='india')]

    name  codes
b  india     91

you can also use `isin`() and `where()` to select data in the Series of data frames

In [28]:
#isin()return false or true when provided value is included in the data frame
sample_codes_names = [1,3,250,'usa','india','england']
df.isin(sample_codes_names)

    name  codes
a   True   True
b   True  False
c  False  False
d  False   True

as you can see it returned `true` wherever a countrycode or name was found,otherwise `false`. you can use a dictioinary to match search by columns A. key must be a column and values are passed in a list

In [29]:
sample_codes_names = {'codes':[1,3,250],'name':['usa','india','england']}
df.isin(sample_codes_names)

    name  codes
a   True   True
b   True  False
c  False  False
d  False   True

In [30]:
df[df['name'].isin(['india'])]

    name  codes
b  india     91

# Exercise 1: DataFrame Creation & Data Selection in Pandas

consider the ff dictionary which is relating the area in sq units of some usa states.
area_dict ={'califonia':423967,'texas':695662,'newyork':141297,'florida':170312,'illonois':149995}

Create a Series using the given dictionary

In [ ]:
#creating a series from a dictionary

area_dict ={'califonia':423967,
            'texas':695662,
            'newyork':141297,
            'florida':170312,
            'illonois':149995}

pd.Series(area_dict)

In [31]:
##convert the pandas series to DataFrame

area_dict = {'califonia':423967,
            'texas':695662,
            'newyork':141297,
            'florida':170312,
            'illonois':149995}


pd_series = pd.Series(area_dict)
df = pd.DataFrame(pd_series,columns = ['areas'])
df

            areas
califonia  423967
texas      695662
newyork    141297
florida    170312
illonois   149995

In [ ]:
#extract areas for 'texas','newyork' and 'florida' from the created data frame

In [32]:
df.iloc[1:4]

          areas
texas    695662
newyork  141297
florida  170312

## note# fill space here

In [33]:
df2= pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9]]),
                  columns=['column1', 'column2','column3'])
df2

   column1  column2  column3
0        1        2        3
1        4        5        6
2        7        8        9

In [34]:
df2[df2<=4]=0
df2

   column1  column2  column3
0        0        0        0
1        0        5        6
2        7        8        9

## iteration
 df.items()#iterate over (column name, Series) pairs.
 df.iteritems() iterate over(column name,Series) pairs.
 DataFrame.iterrows()iterate over DataFrame rows as(index,Series)pairs.
 DataFrame.itertuple([index,name])iterate over DataFrame rows as named tuples

In [35]:
## iterate over (column name,Series)pairs.

for col_name,content in df2.items():
    print(col_name)
    print(content)

column1
0    0
1    0
2    7
Name: column1, dtype: int64
column2
0    0
1    5
2    8
Name: column2, dtype: int64
column3
0    0
1    6
2    9
Name: column3, dtype: int64

In [36]:
# iterate over DataFrame rows as named tuples

for row in df2.itertuples():
    print(row)

Pandas(Index=0, column1=0, column2=0, column3=0)
Pandas(Index=1, column1=0, column2=5, column3=6)
Pandas(Index=2, column1=7, column2=8, column3=9)

## C. Data Wrangling

The difference between data found in many tutorials and data from the real world is that real-world data is rarely clean and homogeneous. In particular, many interesting datasets will have some amount of data missing. To make matters even more complicated, different data sources may indicate missing data in different ways.

In this way, we need to define methods that allow us to structure, clean and enrich the data acquired from the real world, which are the main steps for Data Wrangling. Before continuing, let's see what is the difference between these three steps and expand their definition:

### 1. Data structuring:

The first step in the data wrangling process is to separate the relevant data into multiple columns, so that the analysis can be run grouping by common values in a separate way. In turn, if there are columns that are not desired or that will not be relevant to the analysis, this is the phase to filter the data or mix together some of their columns.

### 2. Data Cleaning

In this step, the data is cleaned up for high-quality analysis. Null values are handled, and the data format is standardized. We will enter this process in the following weeks.

### 3. Data Enriching

After cleaning, the data is enriched by increasing some variables in what is known as Data Augmentation and using additional sources to enrich them for the following stages of processing.

For now, we will review how to handle missing values, a fundamental step for data cleaning.

## d, dealing with missing data

real world datasets are messy,often with missing values. Pandas replace NaN with missing values by default.NaN stands for not a number.

Missing values can either be ignored,dropped or filled.

In [37]:
## creating a dataframe


df3 = pd.DataFrame(np.array([[1,2,3],[4,np.nan,6],[7,np.nan,np.nan]]),columns = ['column1','column2','column3'])
df3

   column1  column2  column3
0      1.0      2.0      3.0
1      4.0      NaN      6.0
2      7.0      NaN      NaN

### checking missing values

In [38]:
# recognising the missing values
df3.isnull()

   column1  column2  column3
0    False    False    False
1    False     True    False
2    False     True     True

In [39]:
## calculating number of the missing values in each feature

df3.isnull().sum()

column1    0
column2    2
column3    1
dtype: int64

In [40]:
## recognizing non missing values

df3.notna()

   column1  column2  column3
0     True     True     True
1     True    False     True
2     True    False    False

In [41]:
df3.notna().sum()

column1    3
column2    1
column3    2
dtype: int64

### removing the missing values

In [42]:
# dropping missing values

df3.dropna()

   column1  column2  column3
0      1.0      2.0      3.0

All rows are deleted because `dropna()` will remove each row which is a missing value

In [43]:
# you can drop NaNs in specific column(s)
df3['column3'].dropna()

0    3.0
1    6.0
Name: column3, dtype: float64

In [44]:
# you can drop data by axis
# Axis = 1... drop all columns with Nans
# df3.dropna(axis=columns)

df3.dropna(axis=1)

   column1
0      1.0
1      4.0
2      7.0

In [45]:
# axis=0...drop all rows with nans
# df3.dropna(axis= 'rows')is same

df3.fillna(10)

   column1  column2  column3
0      1.0      2.0      3.0
1      4.0     10.0      6.0
2      7.0     10.0     10.0

In [46]:
df3.fillna('fillme')

   column1 column2 column3
0      1.0     2.0     3.0
1      4.0  fillme     6.0
2      7.0  fillme  fillme

In [47]:
# you can forward fill(ffill) or backward fill(bfill)
# or fill a current value with previous or next value

df3.fillna(method='ffill')

   column1  column2  column3
0      1.0      2.0      3.0
1      4.0      2.0      6.0
2      7.0      2.0      6.0

In [48]:
# it won't change it because the last values are NaNA,so it backward it

df3.fillna(method = 'bfill')

   column1  column2  column3
0      1.0      2.0      3.0
1      4.0      NaN      6.0
2      7.0      NaN      NaN

In [49]:
# if we change the axis to columns, you can see that Nans at row2 and col2 is backfilled with 6

df3.fillna(method = 'bfill',axis='columns')

   column1  column2  column3
0      1.0      2.0      3.0
1      4.0      6.0      6.0
2      7.0      NaN      NaN

## more operations and functions

This section will show the more and most useful functions in Pandas.

In [50]:
df4 = pd.DataFrame({
    'Product Name':['shirt','boot','bag','blouse','sneakers','hat','singlet','phone','television','shirt'],
    'order number':[45,56,64,67,89,40,33,49,98,7],
    'total quantity':[10,5,9,4,3,3,2,6,1,18]})
df4

  Product Name  order number  total quantity
0        shirt            45              10
1         boot            56               5
2          bag            64               9
3       blouse            67               4
4     sneakers            89               3
5          hat            40               3
6      singlet            33               2
7        phone            49               6
8   television            98               1
9        shirt             7              18

## retrieving basic info about Data Frame

In [51]:
# return a summary about the dataframe
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Product Name    10 non-null     object
 1   order number    10 non-null     int64
 2   total quantity  10 non-null     int64
dtypes: int64(2), object(1)
memory usage: 368.0+ bytes

In [52]:
# return dataframe columns
df4.columns

Index(['Product Name', 'order number', 'total quantity'], dtype='object')

In [53]:
df4.keys

<bound method NDFrame.keys of   Product Name  order number  total quantity
0        shirt            45              10
1         boot            56               5
2          bag            64               9
3       blouse            67               4
4     sneakers            89               3
5          hat            40               3
6      singlet            33               2
7        phone            49               6
8   television            98               1
9        shirt             7              18>

In [54]:
#return the headv of the dataframe....
# choose how many rows you want in head()

df4.head()

  Product Name  order number  total quantity
0        shirt            45              10
1         boot            56               5
2          bag            64               9
3       blouse            67               4
4     sneakers            89               3

In [55]:
# return the tail of the dataframe

df4.size

30

In [56]:
# return the shape

df4.shape

(10, 3)

In [57]:
# return the length of the dataframe the number of rows in the dataframe

df4.shape[0]

10

## unique values

In [58]:
# returns the unique values in a given column

df4['Product Name'].unique()

array(['shirt', 'boot', 'bag', 'blouse', 'sneakers', 'hat', 'singlet',
       'phone', 'television'], dtype=object)

In [59]:
# return a number of unique values
df4['Product Name'].nunique()

9

In [60]:
#counting the occurence of each value in a column
df4['Product Name'].value_counts()

shirt         2
boot          1
bag           1
blouse        1
sneakers      1
hat           1
singlet       1
phone         1
television    1
Name: Product Name, dtype: int64

## Applying a Function to DataFrame

In [61]:
# double the quantity product

def double_quantity(x):
    return x * x

In [62]:
df4['total quantity'].apply(double_quantity)

0    100
1     25
2     81
3     16
4      9
5      9
6      4
7     36
8      1
9    324
Name: total quantity, dtype: int64

In [63]:
# you can also apply an anonymous function to a dataframe
#squaring each value in dataframe

df5 = pd.DataFrame([[1,2],[4,5]],columns=['col1','col2'])
df5

   col1  col2
0     1     2
1     4     5

In [64]:
df5.applymap(lambda x: x**2)

   col1  col2
0     1     4
1    16    25

## sorting values in dataframe

In [65]:
df4

  Product Name  order number  total quantity
0        shirt            45              10
1         boot            56               5
2          bag            64               9
3       blouse            67               4
4     sneakers            89               3
5          hat            40               3
6      singlet            33               2
7        phone            49               6
8   television            98               1
9        shirt             7              18

In [66]:
# sort the df4 by the order number
df4.sort_values(['order number'],ascending = False)

  Product Name  order number  total quantity
8   television            98               1
4     sneakers            89               3
3       blouse            67               4
2          bag            64               9
1         boot            56               5
7        phone            49               6
0        shirt            45              10
5          hat            40               3
6      singlet            33               2
9        shirt             7              18

## f .Aggregation methods

In [67]:
df4

  Product Name  order number  total quantity
0        shirt            45              10
1         boot            56               5
2          bag            64               9
3       blouse            67               4
4     sneakers            89               3
5          hat            40               3
6      singlet            33               2
7        phone            49               6
8   television            98               1
9        shirt             7              18

In [68]:
# summary statistics
df4.describe()

       order number  total quantity
count     10.000000       10.000000
mean      54.800000        6.100000
std       26.624133        5.087021
min        7.000000        1.000000
25%       41.250000        3.000000
50%       52.500000        4.500000
75%       66.250000        8.250000
max       98.000000       18.000000

In [69]:
# summary Statistics of the non-numeric column

df4.describe(include='O').T

             count unique    top freq
Product Name    10      9  shirt    2

In [70]:
df4.describe().transpose()

                count  mean        std  min    25%   50%    75%   max
order number     10.0  54.8  26.624133  7.0  41.25  52.5  66.25  98.0
total quantity   10.0   6.1   5.087021  1.0   3.00   4.5   8.25  18.0

In [71]:
# mode of the dataframe
#mode is the most recurring values

df4['total quantity'].mode()

0    3
Name: total quantity, dtype: int64

In [72]:
df4['total quantity'].max()

18

In [73]:
#the minimum value
df4['total quantity'].std()

5.087020520675908

In [74]:
#variance
df4['total quantity'].var()

25.87777777777778

In [75]:
#sum of all values in a column
df4['total quantity'].sum()

61

In [76]:
#product of all values in dataframe
df4['total quantity'].prod()

3499200

### Groupby

`group by`involves splitting data into groups,applying function to each group,combining the results

In [77]:
df6 = pd.DataFrame({'Product Name':['shirt','boot','bag','ankle','pullover','boot','ankle','tshirt','shirt'],
             'order number':[45,56,64,34,67,56,34,89,45],
             'total quantity':[10,5,9,11,11,8,14,23,10]},
             columns = ['Product Name','order number','total quantity'])

In [78]:
df6

  Product Name  order number  total quantity
0        shirt            45              10
1         boot            56               5
2          bag            64               9
3        ankle            34              11
4     pullover            67              11
5         boot            56               8
6        ankle            34              14
7       tshirt            89              23
8        shirt            45              10

In [79]:
#lets group the df by product name
df6.groupby('Product Name').mean()

              order number  total quantity
Product Name
ankle                 34.0            12.5
bag                   64.0             9.0
boot                  56.0             6.5
pullover              67.0            11.0
shirt                 45.0            10.0
tshirt                89.0            23.0

In [80]:
df6.groupby('Product Name').sum()

              order number  total quantity
Product Name
ankle                   68              25
bag                     64               9
boot                   112              13
pullover                67              11
shirt                   90              20
tshirt                  89              23

In [81]:
df6.groupby('Product Name').min()

              order number  total quantity
Product Name
ankle                   34              11
bag                     64               9
boot                    56               5
pullover                67              11
shirt                   45              10
tshirt                  89              23

In [82]:
df6.groupby(['Product Name','order number']).max()

                           total quantity
Product Name order number
ankle        34                        14
bag          64                         9
boot         56                         8
pullover     67                        11
shirt        45                        10
tshirt       89                        23

In [83]:
df6.groupby('Product Name').aggregate (['min','max','sum'])

             order number          total quantity
                      min max  sum            min max sum
Product Name
ankle                  34  34   68             11  14  25
bag                    64  64   64              9   9   9
boot                   56  56  112              5   8  13
pullover               67  67   67             11  11  11
shirt                  45  45   90             10  10  20
tshirt                 89  89   89             23  23  23

<a name = '1-8'></a>

### H.CrossTab

`Crosstab` compute a simple cross-tabulation of two (or more) factors. by default,computes a frequency table of the
factors unless an array of values and an aggregation function are passed.

when you create a crosstab table,you will need to specify what you want on the `rows`,how to split the `columns`,and
what you would like to include in the `values`

In [84]:
#lets start with a couple of lists of restaurants

restaurant_names = ['fc','ll','fc','sc','ts','fc','sc']
purchase_type = ['food','food','food','drink','food','drink','drink']
price = [12,25,32,10,15,22,18]

print('Restaurant names: {}'.format(restaurant_names))
print('Purchase Type: {}'.format(purchase_type))
print('Price: {}'.format(price))

Restaurant names: ['fc', 'll', 'fc', 'sc', 'ts', 'fc', 'sc']
Purchase Type: ['food', 'food', 'food', 'drink', 'food', 'drink', 'drink']
Price: [12, 25, 32, 10, 15, 22, 18]

In [85]:
# creating a simple crosstab method

pd.crosstab(index=restaurant_names,columns=[purchase_type])

col_0  drink  food
row_0
fc         1     2
ll         0     1
sc         2     0
ts         0     1

By default(in the example above) crosstab will count the frequencies in which an intersection happens. Notice how '5C' and 'Drink' intersection happens twice, so it's listed as '2' in the values.

But what if we wanted to summarize the price by summing them up? You can do that by passing values and aggfunc.

In [86]:
#simple crosstab with sum aggregate function

pd.crosstab(index=[restaurant_names],columns=[purchase_type],values = price,aggfunc=sum)

col_0  drink  food
row_0
fc      22.0  44.0
ll       NaN  25.0
sc      28.0   NaN
ts       NaN  15.0

In [ ]:
# Creating a crosstab with numpy array

# creating some data

a = np.array(["foo", "foo", "foo", "foo","bar", "bar", "bar", "bar","foo", "foo", "foo"],dtype=object)

b = np.array(["one", "one", "one", "two","one", "one", "one", "two","two", "two", "one"],dtype=object)

c = np.array(["dull", "dull", "shiny","dull", "dull", "shiny","shiny", "dull", "shiny","shiny", "shiny"],dtype=object)

# form the cross tab
pd.crosstab(index = a, columns = [b, c], rownames=['a'], colnames=['b', 'c'])

In [ ]:
#Crosstab comes with many other parameters you can use. Check out the [documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.crosstab.html) for reference

## combining datasets: concatenating, joining and merging

## concatenation

In [87]:
#Creating dataframes

df1=pd.DataFrame({'col1':['A','B','C'],
                 'col2':[1,2,3]},
                index=['a','b','c'])

df2=pd.DataFrame({'col1':['D','E','F'],
                 'col2':[4,5,6]},
                index=['d','e','f'])

df3=pd.DataFrame({'col1':['G','I','J'],
                 'col2':[7,8,9]},
                index=['g','i','j'])

In [88]:
df1

  col1  col2
a    A     1
b    B     2
c    C     3

In [89]:
df2

  col1  col2
d    D     4
e    E     5
f    F     6

In [90]:
df3

  col1  col2
g    G     7
i    I     8
j    J     9

In [91]:
# concatenating: adding one dataset to another
pd.concat([df1,df2,df3])

  col1  col2
a    A     1
b    B     2
c    C     3
d    D     4
e    E     5
f    F     6
g    G     7
i    I     8
j    J     9

the default axis is `0`. this is how the combined dataframes will look like if we change the axis to 1

In [92]:
pd.concat([df1,df2,df3],axis=1)

  col1  col2 col1  col2 col1  col2
a    A   1.0  NaN   NaN  NaN   NaN
b    B   2.0  NaN   NaN  NaN   NaN
c    C   3.0  NaN   NaN  NaN   NaN
d  NaN   NaN    D   4.0  NaN   NaN
e  NaN   NaN    E   5.0  NaN   NaN
f  NaN   NaN    F   6.0  NaN   NaN
g  NaN   NaN  NaN   NaN    G   7.0
i  NaN   NaN  NaN   NaN    I   8.0
j  NaN   NaN  NaN   NaN    J   9.0

## merging 
 if you have worked with SQl,what `pd.merge()` does may be familiar. it links data from different sources(diff features) and you have a control on the structure of the combined dataset

* left : LEFT OUTER JOIN : Use keys or columns from left frame only

* right : RIGHT OUTER JOIN : Use keys or columns from right frame only

* outer : FULL OUTER JOIN : Use union of keys or columns from both frames

* inner : INNER JOIN : Use intersection of keys or columns from both frames

In [93]:
df1 = pd.DataFrame({'name':['joe','joshua','jeanee','david'],
                     'role':['manager','developer','engineer','scientist']})
df2 = pd.DataFrame({'name':['david','joshua','joe','jeanee'],
'year hired': [2018,2017,2020,2018]})

df3 = pd.DataFrame({'name':['david','joshua','joe','jeanee'],
'no of leaves': [15,3,10,12]})

In [94]:
df1

     name       role
0     joe    manager
1  joshua  developer
2  jeanee   engineer
3   david  scientist

In [95]:
df2

     name  year hired
0   david        2018
1  joshua        2017
2     joe        2020
3  jeanee        2018

In [96]:
pd.merge(df1,df2)

     name       role  year hired
0     joe    manager        2020
1  joshua  developer        2017
2  jeanee   engineer        2018
3   david  scientist        2018

In [97]:
#lets merge on the name being a key

pd.merge(df1,df2,how ='inner',on = 'name')

     name       role  year hired
0     joe    manager        2020
1  joshua  developer        2017
2  jeanee   engineer        2018
3   david  scientist        2018

### add the screen shots,bring in the wine and housing herer

Data Visualizations with Matplotlib
To gain more insights or understand the problem you're solving, it is very important to visualize the dataset that you are working with.
Matplotlib is powerful visualization tool in Python. It can be used to create 2D and 3D figures. Seaborn that we will see later is built on Matplotlib.
This is what you will learn:
1. Basics of Matplotlib 2. Types of Plots
3. Image Plotting
4. Further Resources
If you would like more inspirations before continue, you can check out the Gallery page of Matplotlib - The plots there are fascinating. 1. Basics of Matplotlib
Importing Matplotlib
         import matplotlib.pyplot as plt

In [5]:
import matplotlib.pyplot as plt 
import numpy as np
%matplotlib in
# Or plt.show()for other editors or if you are using scripts (.py)

SyntaxError: invalid syntax (1217108035.py, line 1)